src/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПоставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Весовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеИзображений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Номенклатура/Forms/ФормаСпискаОсновная/Ext/Form/Module.bsl
&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	Список.Параметры.УстановитьЗначениеПараметра("Склад", Склад);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Организация") Тогда
		
		ПараметрыФО = Новый Структура;
		ПараметрыФО.Вставить("Организация", Параметры.Организация);
		
		Если Параметры.Свойство("Дата") Тогда
			
			ПараметрыФО.Вставить("Период", Параметры.Дата);			
		
		КонецЕсли;
		
		ВыпускПродукции = ПолучитьФункциональнуюОпцию("ВыпускПродукции", ПараметрыФО);
		
		Если Не ВыпускПродукции Тогда
		
			Если Параметры.Отбор.Свойство("ВидНоменклатуры") Тогда
				
				Если ТипЗнч(Параметры.Отбор.ВидНоменклатуры) = Тип("ФиксированныйМассив") Тогда
				
					МассивВидовНоменклатуры = Новый Массив(Параметры.Отбор.ВидНоменклатуры);
					Индекс = МассивВидовНоменклатуры.Найти(Перечисления.ВидыНоменклатуры.Продукция);
					
					Если Индекс<>Неопределено Тогда
					
						МассивВидовНоменклатуры.Удалить(Индекс);
						Параметры.Отбор.ВидНоменклатуры = МассивВидовНоменклатуры;
					
					КонецЕсли;
					
				ИначеЕсли Параметры.Отбор.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Продукция Тогда
					
					Сообщить("Выбор продукции запрещен для данной организации!");
					Отказ = Истина;
					Возврат;
				
				КонецЕсли;				
				
			Иначе
				
				МассивВидовНоменклатуры = Новый Массив();
				МассивВидовНоменклатуры.Добавить(Перечисления.ВидыНоменклатуры.Товар);
				МассивВидовНоменклатуры.Добавить(Перечисления.ВидыНоменклатуры.Материал);
				МассивВидовНоменклатуры.Добавить(Перечисления.ВидыНоменклатуры.Услуга);
				
				Параметры.Отбор.Вставить("ВидНоменклатуры", МассивВидовНоменклатуры);
			
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	
	Склад = Параметры.Склад;
	
	Список.Параметры.УстановитьЗначениеПараметра("Склад", Склад);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимыОткрытияФормы(Команда)
	
	//ОткрытьФорму("Отчет.НастройкиКомпоновкиДанных.Форма",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	ОткрытьФормуМодально("Отчет.НастройкиКомпоновкиДанных.Форма",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Тест(Команда)
	ТестНаСервере();
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТестНаСервере()
	
	НастройкиНачальнойСтраницы = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиНачальнойСтраницы");
	СоставФорм = НастройкиНачальнойСтраницы.ПолучитьСоставФорм();
	НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы",,НастройкиНачальнойСтраницы);
	
КонецПроцедуры
